tap "deskflow/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Render markdown on the CLI
brew "glow"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Deep clean and optimize your Mac
brew "mole"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Write, edit, and chat about your code with AI
cask "cursor"
# Mouse and keyboard sharing utility
cask "deskflow/tap/deskflow"
# Turns any device with a web browser into a secondary screen
cask "deskreen"
# Dictionary and translator app
cask "easydict"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Open-source screen recorder built with web technology
cask "kap"
# GPU-based terminal emulator
cask "kitty"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Control your tools with a few keystrokes
cask "raycast"
# Snip or pin screenshots
cask "snipaste"
# Open-source code editor
cask "visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "mhutchie.git-graph"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ryu1kn.partial-diff"
vscode "shopify.theme-check-vscode"
vscode "vscode-icons-team.vscode-icons"
